In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#### EDA & Feature Engineering

In [4]:
data=pd.read_csv("../Data/Car Ownership.csv")

In [5]:
data.head()

,Occupation,Monthly Income,Credit Score,Years of Employment,Finance Status,Finance History,Car,Number of Children
0,Teacher,40000,750.0,10,Good,No issues,Yes,2
1,Engineer,60000,800.0,8,Good,No issues,Yes,1
2,Nurse,25000,650.0,5,Fair,Late payment 2 months ago,No,0
3,Doctor,80000,900.0,12,Excellent,No issues,Yes,3
4,Businessman,100000,700.0,15,Good,Late payment 6 months ago,Yes,2

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Occupation           490 non-null    object
 1   Monthly Income       487 non-null    object
 2   Credit Score         460 non-null    float64
 3   Years of Employment  457 non-null    object
 4   Finance Status       477 non-null    object
 5   Finance History      472 non-null    object
 6   Car                  480 non-null    object
 7   Number of Children   375 non-null    object
dtypes: float64(1), object(7)
memory usage: 31.4+ KB

In [7]:
data.describe()

       Credit Score
count    460.000000
mean     702.969565
std       69.232323
min      500.000000
25%      650.000000
50%      700.000000
75%      750.000000
max      900.000000

In [8]:
data['Car'].value_counts()

Yes    301
No     179
Name: Car, dtype: int64

In [9]:
for col in data.columns:
    print(f"--------------{col}--------------")
    print(data[col].value_counts())
    print("\n")

--------------Occupation--------------
Chef                         34
Electrician                  19
Graphic Designer             17
Nurse                        16
Architect                    13
                             ..
Retail Salesperson            1
Bartender                     1
Librarian                     1
Elementary School Teacher     1
Customer Support              1
Name: Occupation, Length: 116, dtype: int64


--------------Monthly Income--------------
$4,500       33
$3,500       27
$3,200       20
$4,200       18
$3,000       18
             ..
10000 USD     1
3500 USD      1
2.5k          1
6000 usd      1
$7            1
Name: Monthly Income, Length: 98, dtype: int64


--------------Credit Score--------------
670.0    32
680.0    31
720.0    29
650.0    27
690.0    22
         ..
830.0     1
770.0     1
890.0     1
840.0     1
641.0     1
Name: Credit Score, Length: 64, dtype: int64


--------------Years of Employment--------------
4 years     74
3 years     58
2 years     54
5 years     53
6 years     49
1 year      39
7 years     31
8 years     13
3            9
10           8
1            7
8            7
9 years      6
5            6
2            5
4            4
6            4
10 years     4
12           4
7            3
7 y          2
2 year       2
2 y          2
15           2
20           2
3 year       1
6 year       1
12 years     1
3 y          1
11 years     1
7 year       1
8 year       1
4 year       1
5 year       1
Name: Years of Employment, dtype: int64


--------------Finance Status--------------
Stable       304
Unstable      87
Fair          28
Good          26
Excellent     22
Poor           8
Unknow         1
Unkonw         1
Name: Finance Status, dtype: int64


--------------Finance History--------------
No significant issues                        313
Missed payments in the past                   52
Late payments                                 31
Late payments, collections                    17
No issues                                     12
Poor                                          12
Excellent                                     10
Good                                           8
Fair                                           6
Late payment 2 months ago                      2
Late payment 6 months ago                      2
Late payment 3 months ago                      2
Late payment 1 month ago                       2
Late payment                                   1
No significant issue                           1
Missed payments, collections, charge-offs      1
Name: Finance History, dtype: int64


--------------Car--------------
Yes    301
No     179
Name: Car, dtype: int64


--------------Number of Children--------------
0     120
1     112
2      95
na     29
3      18
4       1
Name: Number of Children, dtype: int64

#### converting columns into their correct format

#### Handle null values

In [13]:
data.isna().sum()

Occupation              10
Monthly Income          13
Credit Score            40
Years of Employment     43
Finance Status          23
Finance History         28
Car                     20
Number of Children     125
dtype: int64

In [20]:
for col in data.columns:
    if data[col].isnull().any():
        print(f"{col}-------{(data[col].isnull().sum()/data.shape[0])*100:.2f}")

Occupation-------2.00
Monthly Income-------2.60
Credit Score-------8.00
Years of Employment-------8.60
Finance Status-------4.60
Finance History-------5.60
Car-------4.00
Number of Children-------25.00

##### handle it using statistic properties

In [23]:
categorical_columns=[]
numerical_columns=[]

for col in data.columns:
    if data[col].dtype=="object":
        categorical_columns.append(col)
    else:
        numerical_columns.append(col)

In [24]:
numerical_columns

['Credit Score']